//$(document).ready(function () {
// jQueryプログラムの内容
//});　以下同義

//$(function(){
// jQueryプログラムの内容
//});　HTMLの読み込みがおわってからjQueryが実行される記述

//内容
//$( セレクタ ).メソッド ( パラメータ );
//セクレタ＝操作の対象(ココデハbody)　メゾッド＝何を行うのか記述(html)　パラメータ＝メゾッドに行う内容(記述ない場合、メゾッドが取得される)

//$(document).ready(function () {
//  $('body').html('<h1>Hello jQuery!!</h1>');
//});
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//$(function(){
//  $('.box1').css({
//    'background-color':'#0000FF',
//    'height':'100px'
//  });
//});

//1つの時・・・$('セレクタ').css('background-color','#0000FF');
//複数の時・・・$('セレクタ').css({
//            $('セレクタ').css({
//              'プロパティ1': '値1',
//              'プロパティ2': '値2',
//            
//              :
//              :
//            
//              'プロパティn': '値n'
//            });
///////////////////////////////////////////////////////////////////////////////////////////
//上から下へのアニメーション(sildeDown)・下から上(sideUp)表示されているものを隠していく為、display:none;だと機能しない
//$(function () {
//  $('.box1').slideUp();
//})
///////////////////////////////////////////////////////////////////////////////////////////////////////
//表示
//$(function () {
//  $('.box1').show();
//  $('.box1').css({
//    'background-color': '#0000FF'
//  });
//});
///////////////////////////////////////////////
//非表示
//(display:none;をなくした上で)
//$(function () {
//  $('.box1').hide();
//});

//.slideDown();、.slideUp();、.show();、.hide();の4つを使えるようになると、さまざまなスタイルに応用できます。
//たとえば、特定のクラス名のdiv要素のみ表示・非表示を切り替えるといったことが可能になります。
///////////////////////////////////////////////////////////////////////////////////////////////////////////////

//$(function () {
//  $('.box1').slideDown(function () {
//    $('.box1').css({
//      'background-color': '#0000FF',
//      'width': '200px',
//      'height': '100px',
//    }).slideUp();
//  });
//});
//javascriptでは、引数の中に関数を入れることができます。
//slideDown()の引数にfunctionを書き加えることで、スライドダウンした後にfunctionを実行することができるようになります。
//ですのでslideDownの中のfunctionに、cssで色と大きさを変え、slideUp()をすることで要件を満たすことができます。

//因みに、アニメーションの速度を変える場合はslideDown()の第一引数に数字を入力することで実現できます。（単位はミリ秒なので、1秒の場合は'1000'になります。）

//$(function(){
//  $('.box1').mouseover(function(){
//    $('.box1').addClass('box1-ext');
//  });
//  $('.box1').mouseout(function(){
//    $('.box1').removeClass('box1-ext');
//  });
//});
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

